uTasker/uTasker-Kinetis/Applications/uTaskerBoot/config.h
            #define POWER_DOWN_SPI_FLASH_INTERFACE() POWER_DOWN(6, SIM_SCGC6_SPI0) // power down SPI interface if no SPI Flash detected

            #define FLUSH_SPI_FIFO_AND_FLAGS()       SPI0_MCR |= SPI_MCR_CLR_RXF; SPI0_SR = (SPI_SR_EOQF | SPI_SR_TFUF | SPI_SR_TFFF | SPI_SR_RFOF | SPI_SR_RFDF);

            #define WRITE_SPI_CMD0(byte)             SPI0_PUSHR = (byte | SPI_PUSHR_CONT | ulChipSelectLine | SPI_PUSHR_CTAS_CTAR0) // write a single byte to the output FIFO - assert CS line
            #define WRITE_SPI_CMD0_LAST(byte)        SPI0_PUSHR = (byte | SPI_PUSHR_EOQ  | ulChipSelectLine | SPI_PUSHR_CTAS_CTAR0) // write final byte to output FIFO - this will negate the CS line when complete
            #define READ_SPI_FLASH_DATA()            (volatile unsigned char)SPI0_POPR
            #define WAIT_SPI_RECEPTION_END()         while (!(SPI0_SR & SPI_SR_RFDF)) {}
            #define CLEAR_RECEPTION_FLAG()           SPI0_SR |= SPI_SR_RFDF
        #elif defined FRDM_KL25Z
            // - SPI1_CS   PTE-4 (J9-13)
            // - SPI1_SCK  PTE-2 (J9-9)
            // - SPI1_MOSI PTE-1 (J2-20)
            // - SPI1_MISO PTE-3 (J9-11)
            //
            #define CS0_LINE                        PORTE_BIT4           // CS0 line used when SPI FLASH is enabled
            #define CS1_LINE                                             // CS1 line used when extended SPI FLASH is enabled
            #define CS2_LINE                                             // CS2 line used when extended SPI FLASH is enabled
            #define CS3_LINE                                             // CS3 line used when extended SPI FLASH is enabled

            #define ASSERT_CS_LINE(ulChipSelectLine) _CLEARBITS(E, ulChipSelectLine)
            #define NEGATE_CS_LINE(ulChipSelectLine) _SETBITS(E, ulChipSelectLine)

            #define SPI_CS0_PORT                    GPIOE_PDOR           // for simulator
            #define SPI_TX_BYTE                     SPI1_D               // for simulator
            #define SPI_RX_BYTE                     SPI1_D               // for simulator

            #define POWER_UP_SPI_FLASH_INTERFACE()  POWER_UP_ATOMIC(4, SPI1)
            #define CONFIGURE_SPI_FLASH_INTERFACE() _CONFIG_PERIPHERAL(E, 2, PE_2_SPI1_SCK); \
                                                    _CONFIG_PERIPHERAL(E, 1, (PE_1_SPI1_MOSI | PORT_SRE_FAST | PORT_DSE_HIGH)); \
                                                    _CONFIG_PERIPHERAL(E, 3, (PE_3_SPI1_MISO | PORT_PS_UP_ENABLE)); \
                                                    _CONFIG_DRIVE_PORT_OUTPUT_VALUE(E, CS0_LINE, CS0_LINE, (PORT_SRE_FAST | PORT_DSE_HIGH)); \
                                                    SPI1_C1 = (SPI_C1_CPHA | SPI_C1_CPOL | SPI_C1_MSTR | SPI_C1_SPE); \
                                                    SPI1_BR = (SPI_BR_SPPR_PRE_1 | SPI_BR_SPR_DIV_2); \
                                                    (unsigned char)SPI1_S; (unsigned char)SPI1_D

            #define POWER_DOWN_SPI_FLASH_INTERFACE() POWER_DOWN_ATOMIC(4, SPI1) // power down SPI interface if no SPI Flash detected

            #define FLUSH_SPI_FIFO_AND_FLAGS()

            #define WRITE_SPI_CMD0(byte)            SPI1_D = (byte)      // write a single byte
            #define WRITE_SPI_CMD0_LAST(byte)       SPI1_D = (byte)      // write final byte
            #define READ_SPI_FLASH_DATA()           (unsigned char)SPI1_D
            #if defined _WINDOWS
                #define WAIT_SPI_RECEPTION_END()    while ((SPI1_S & (SPI_S_SPRF)) == 0) {SPI1_S |= SPI_S_SPRF;}
            #else
                #define WAIT_SPI_RECEPTION_END()    while ((SPI1_S & (SPI_S_SPRF)) == 0) {}
            #endif
            #define CLEAR_RECEPTION_FLAG()

            #define SET_SPI_FLASH_MODE()                                 // this can be used to change SPI settings on-the-fly when the SPI is shared with SPI Flash and other devices
            #define REMOVE_SPI_FLASH_MODE()                              // this can be used to change SPI settings on-the-fly when the SPI is shared with SPI Flash and other devices
        #else
            #define CS0_LINE                         SPI_PUSHR_PCS0      // CS0 line used when SPI FLASH is enabled

            #define SPI_CS0_PORT                     ~(SPI2_PUSHR)       // for simulator
            #define SPI_TX_BYTE                      SPI2_PUSHR          // for simulator
            #define SPI_RX_BYTE                      SPI2_POPR           // for simulator

            #define POWER_UP_SPI_FLASH_INTERFACE()   POWER_UP(3, SIM_SCGC3_SPI2)
            #define CONFIGURE_SPI_FLASH_INTERFACE()  _CONFIG_PERIPHERAL(D, 11, (PD_11_SPI2_PCS0 | PORT_SRE_FAST | PORT_DSE_HIGH));\
                                                     _CONFIG_PERIPHERAL(D, 12, (PD_12_SPI2_SCK | PORT_SRE_FAST | PORT_DSE_HIGH));\
                                                     _CONFIG_PERIPHERAL(D, 13, (PD_13_SPI2_SOUT | PORT_SRE_FAST | PORT_DSE_HIGH));\
                                                     _CONFIG_PERIPHERAL(D, 14, PD_14_SPI2_SIN);\
                                                     SPI2_MCR = (SPI_MCR_MSTR | SPI_MCR_DCONF_SPI | SPI_MCR_CLR_RXF | SPI_MCR_CLR_TXF | SPI_MCR_PCSIS_CS0 | SPI_MCR_PCSIS_CS1 | SPI_MCR_PCSIS_CS2 | SPI_MCR_PCSIS_CS3 | SPI_MCR_PCSIS_CS4 | SPI_MCR_PCSIS_CS5);\
                                                     SPI2_CTAR0 = (SPI_CTAR_DBR | SPI_CTAR_FMSZ_8 | SPI_CTAR_PDT_7 | SPI_CTAR_BR_2 | SPI_CTAR_CPHA | SPI_CTAR_CPOL); // for 50MHz bus, 25MHz speed and 140ns min de-select time

            #define POWER_DOWN_SPI_FLASH_INTERFACE() POWER_DOWN(3, SIM_SCGC3_SPI2) // power down SPI interface if no SPI Flash detected

            #define FLUSH_SPI_FIFO_AND_FLAGS()       SPI2_MCR |= SPI_MCR_CLR_RXF; SPI2_SR = (SPI_SR_EOQF | SPI_SR_TFUF | SPI_SR_TFFF | SPI_SR_RFOF | SPI_SR_RFDF);


            #define WRITE_SPI_CMD0(byte)             SPI2_PUSHR = (byte | SPI_PUSHR_CONT | ulChipSelectLine | SPI_PUSHR_CTAS_CTAR0) // write a single byte to the output FIFO - assert CS line
            #define WRITE_SPI_CMD0_LAST(byte)        SPI2_PUSHR = (byte | SPI_PUSHR_EOQ  | ulChipSelectLine | SPI_PUSHR_CTAS_CTAR0) // write final byte to output FIFO - this will negate the CS line when complete
            #define READ_SPI_FLASH_DATA()            (volatile unsigned char)SPI2_POPR // {21}
            #define WAIT_SPI_RECEPTION_END()         while (!(SPI2_SR & SPI_SR_RFDF)) {}
            #define CLEAR_RECEPTION_FLAG()           SPI2_SR |= SPI_SR_RFDF
        #endif
            
        #define SET_SPI_FLASH_MODE()                                     // this can be used to change SPI settings on-the-fly when the SPI is shared with SPI Flash and other devices
        #define REMOVE_SPI_FLASH_MODE()                                  // this can be used to change SPI settings on-the-fly when the SPI is shared with SPI Flash and other devices

        #define SPI_FLASH_START        (FLASH_START_ADDRESS + SIZE_OF_FLASH) // SPI FLASH starts immediately after FLASH

        #if defined SPI_FLASH_ST                                         // ST SPI FLASH used
          //#define SPI_FLASH_STM25P05                                   // the available ST chips
          //#define SPI_FLASH_STM25P10
          //#define SPI_FLASH_STM25P20
          //#define SPI_FLASH_STM25P40
          //#define SPI_FLASH_STM25P80                                               
          //#define SPI_FLASH_STM25P16                                               
          //#define SPI_FLASH_STM25P32                                               
            #define SPI_FLASH_STM25P64
          //#define SPI_FLASH_STM25P128

            #if defined SPI_FLASH_STM25P05                               // 64k
                #define SPI_FLASH_PAGES             (1 * 256)                          
            #elif defined SPI_FLASH_STM25P10                             // 128k
                #define SPI_FLASH_PAGES             (2 * 256)
            #elif defined SPI_FLASH_STM25P20                             // 256k
                #define SPI_FLASH_PAGES             (4 * 256)
            #elif defined SPI_FLASH_STM25P40                             // 512k
                #define SPI_FLASH_PAGES             (8 * 256)
            #elif defined SPI_FLASH_STM25P80                             // 1M
                #define SPI_FLASH_PAGES             (16 * 256)
            #elif defined SPI_FLASH_STM25P16                             // 2M
                #define SPI_FLASH_PAGES             (32 * 256)
            #elif defined SPI_FLASH_STM25P32                             // 4M
                #define SPI_FLASH_PAGES             (64 * 256)
            #elif defined SPI_FLASH_STM25P64                             // 8M
                #define SPI_FLASH_PAGES             (128 * 256)
            #elif defined SPI_FLASH_STM25P128                            // 16M
                #define SPI_FLASH_PAGES             (256 * 256)
            #endif
            #define SPI_FLASH_PAGE_LENGTH 256
            #if defined SPI_DATA_FLASH
                #define SPI_FLASH_SECTOR_LENGTH (16 * SPI_FLASH_PAGE_LENGTH) // sub-sector size of data FLASH
            #else
                #define SPI_FLASH_SECTOR_LENGTH (256 * SPI_FLASH_PAGE_LENGTH) // sector size of code FLASH
            #endif
            #define SPI_FLASH_BLOCK_LENGTH  SPI_FLASH_SECTOR_LENGTH
        #elif defined SPI_FLASH_SST25
          //#define SPI_FLASH_SST25VF010A                                // the supported SST chips
          //#define SPI_FLASH_SST25LF020A
          //#define SPI_FLASH_SST25LF040A
          //#define SPI_FLASH_SST25VF040B
          //#define SPI_FLASH_SST25VF080B
            #define SPI_FLASH_SST25VF016B
          //#define SPI_FLASH_SST25VF032B

            #if defined SPI_FLASH_SST25VF010A                            // 1Mbit (128k)
                #define SST25_A_VERSION
                #define SPI_FLASH_PAGES             (32)
            #elif defined SPI_FLASH_SST25LF020A                          // 2Mbit (256k)
                #define SST25_A_VERSION
                #define SPI_FLASH_PAGES             (64)
            #elif defined SPI_FLASH_SST25LF040A                          // 4Mbit (512k)
                #define SST25_A_VERSION
                #define SPI_FLASH_PAGES             (128)
            #elif defined SPI_FLASH_SST25VF040B                          // 4Mbit (512k)
                #define SPI_FLASH_PAGES             (128)
            #elif defined SPI_FLASH_SST25VF080B                          // 8Mbit (1M)
                #define SPI_FLASH_PAGES             (256)
            #elif defined SPI_FLASH_SST25VF016B                          // 16Mbit (2M)
                #define SPI_FLASH_PAGES             (512)
            #elif defined SPI_FLASH_SST25VF032B                          // 32Mbit (4M)
                #define SPI_FLASH_PAGES             (1024)
            #endif

            #define SPI_FLASH_SUB_SECTOR_LENGTH  (4 * 1024)              // sub-sector size of SPI FLASH
            #define SPI_FLASH_HALF_SECTOR_LENGTH (32 * 1024)             // half-sector size of SPI FLASH
            #define SPI_FLASH_SECTOR_LENGTH      (64 * 1024)             // sector size of SPI FLASH (not available on A-versions)

            #define SPI_FLASH_PAGE_LENGTH        SPI_FLASH_SUB_SECTOR_LENGTH // for compatibility - smallest erasable block
            #define SPI_FLASH_BLOCK_LENGTH       SPI_FLASH_SUB_SECTOR_LENGTH // for compatibility - file system granularity
        #else                                                            // AT45DBxxx 
          //#define SPI_FLASH_AT45DB011                                  // define the ATMEL type used here
          //#define SPI_FLASH_AT45DB021
          //#define SPI_FLASH_AT45DB041
          //#define SPI_FLASH_AT45DB081
          //#define SPI_FLASH_AT45DB161
            #define SPI_FLASH_AT45DB321
          //#define SPI_FLASH_AT45DB642
            #define SPI_FLASH_AT45XXXXD_TYPE                             // specify that a D-type rather than a B/C type is being used

            #define SPI_FLASH_ATMEL                                      // default if nothing else defined
            #if defined SPI_FLASH_AT45DB642                              // define whether used in power of 2 mode or not
                #define SPI_FLASH_PAGE_LENGTH 1056                       // standard page size (B-device only allows 1056)
              //#define SPI_FLASH_PAGE_LENGTH 1024                       // size when power of 2 mode selected (only possible on D-device)
                #define SPI_FLASH_PAGES             (32 * 1024)          // 8Meg part
            #elif defined SPI_FLASH_AT45DB321 || defined SPI_FLASH_AT45DB161
                #define SPI_FLASH_PAGE_LENGTH 528                        // standard page size (B/C-device only allows 528)
              //#define SPI_FLASH_PAGE_LENGTH 512                        // size when power of 2 mode selected (only possible on D-device)
                #if defined SPI_FLASH_AT45DB161
                    #define SPI_FLASH_PAGES         (4 * 1024)           // 2Meg part
                #else
                    #define SPI_FLASH_PAGES         (8 * 1024)           // 4Meg part
                #endif
            #else
                #define SPI_FLASH_PAGE_LENGTH 264                        // standard page size (B-device only allows 264)
              //#define SPI_FLASH_PAGE_LENGTH 256                        // size when power of 2 mode selected (only possible on D-device)
                #if defined SPI_FLASH_AT45DB011
                    #define SPI_FLASH_PAGES         (512)                // 128k part
                #elif defined SPI_FLASH_AT45DB021
                    #define SPI_FLASH_PAGES         (1024)               // 256k part
                #elif defined SPI_FLASH_AT45DB041
                    #define SPI_FLASH_PAGES         (2 * 1024)           // 512k part
                #elif defined SPI_FLASH_AT45DB081
                    #define SPI_FLASH_PAGES         (4 * 1024)           // 1Meg part
                #endif
            #endif

