uTasker/uTasker-Kinetis/Applications/uTaskerBoot/config.h
                #define SPI_CS0_PORT                GPIOC_ODR            // for simulator
                #define __ASSERT_CS(cs_line)        _CLEARBITS(C, cs_line)
                #define __NEGATE_CS(cs_line)        _SETBITS(C, cs_line)

                #define SSPDR_X                     SPI1_DR
                #define SSPSR_X                     SPI1_SR

                // SPI 1 used for SPI Flash interface - speed set to 12.5MHz (PCLK1 100MHz/8)
                //
                #define POWER_UP_SPI_FLASH_INTERFACE()      POWER_UP(APB2, (RCC_APB2ENR_SPI1EN))
                #define POWER_DOWN_SPI_FLASH_INTERFACE()    POWER_DOWN(APB2, (RCC_APB2ENR_SPI1EN))
                #define CONFIGURE_SPI_FLASH_INTERFACE()     _CONFIG_DRIVE_PORT_OUTPUT_VALUE(C, CS0_LINE, (OUTPUT_FAST | OUTPUT_PUSH_PULL), CS0_LINE); \
                _CONFIG_PERIPHERAL_OUTPUT(A, (PERIPHERAL_SPI1_2_I2S2ext), (SPI1_CLK_A_5 | SPI1_MOSI_A_7), (OUTPUT_FAST | OUTPUT_PUSH_PULL | INPUT_PULL_DOWN)); \
                _CONFIG_PERIPHERAL_INPUT(A,  (PERIPHERAL_SPI1_2_I2S2ext), (SPI1_MISO_A_6), INPUT_PULL_DOWN); \
                _RESET_CYCLE_PERIPHERAL(APB2, RCC_APB2RSTR_SPI1RST); \
                SPI1_CR1 = (SPICR1_BR_PCLK2_DIV2 | SPICR1_MSTR | SPICR1_SSI | SPICR1_CPOL | SPICR1_CPHA | SPICR1_SSM); \
                SPI1_I2SCFGR = 0; \
                SPI1_CR1 = (SPICR1_SPE | SPICR1_BR_PCLK2_DIV2 | SPICR1_MSTR | SPICR1_SSI | SPICR1_CPOL | SPICR1_CPHA | SPICR1_SSM)
            #endif
        #elif defined NUCLEO_F746ZG
            #define _STM32F7XX
            #define _STM32F746
            #define CRYSTAL_FREQ        8000000                          // this is in fact an 8MHz clock output from the ST link
          //#define DISABLE_PLL                                          // run from clock source directly
          //#define USE_HSI_CLOCK                                        // use internal HSI clock source
            #define PLL_INPUT_DIV       4                                // 2..64 - should set the input to pll in the range 1..2MHz (with preference near to 2MHz)
            #define PLL_VCO_MUL         168                              // 64 ..432 where VCO must be 64..432MHz
            #define PLL_POST_DIVIDE     2                                // post divide VCO by 2, 4, 6, or 8 to get the system clock speed
            #define PIN_COUNT           PIN_COUNT_144_PIN
            #define PACKAGE_TYPE        PACKAGE_LQFP
            #define SIZE_OF_RAM         (320 * 1024)                     // 320k SRAM (DTCM + SRAM1 + SRAM2)
            #define SIZE_OF_FLASH       (1024 * 1024)                    // 1M FLASH
            #define SUPPLY_VOLTAGE      SUPPLY_2_7__3_6                  // power supply is in the range 2.7V..3.6V
            #define PCLK1_DIVIDE        4
            #define PCLK2_DIVIDE        2
            #define HCLK_DIVIDE         1
        #elif defined NUCLEO_F429ZI
            #define _STM32F4XX                                           // part group
            #define _STM32F42X
            #define PIN_COUNT           PIN_COUNT_144_PIN
            #define CRYSTAL_FREQ        8000000                          // 8MHz Crystal
            #define PLL_INPUT_DIV       4                                // 2..64 - should set the input to pll in the range 1..2MHz (with preference near to 2MHz)
            #define PLL_VCO_MUL         168                              // 64 ..432 where VCO must be 192..432MHz
            #define _STM32F429
            #define PLL_POST_DIVIDE     2                                // post divide VCO by 2, 4, 6, or 8 to get the system clock speed
            #define HCLK_DIVIDE         1                                // HCLK is divided by 1 (1, 2, 4, 8, 16, 64, 128 or 512 are possible) - max. 168MHz
            #define PCLK1_DIVIDE        4                                // PCLK1 is HCLK divided by 4 (1, 2, 4, 8, or 16 are possible) - max. 42MHz
            #define PCLK2_DIVIDE        2                                // PCLK2 is HCLK divided by 2 (1, 2, 4, 8, or 16 are possible) - max. 84MHz
            #define PACKAGE_TYPE        PACKAGE_LQFP
            #define SIZE_OF_RAM         (192 * 1024)                     // 192k SRAM (0x20000000)
            #define SIZE_OF_CCM         (64 * 1024)                      // 64k Core Coupled Memory (0x10000000)
            #define SIZE_OF_FLASH       (2 * 1024 * 1024)                // 2M FLASH
            #define SUPPLY_VOLTAGE      SUPPLY_2_7__3_6                  // power supply is in the range 2.7V..3.6V
        #endif
        // Include the hardware header here
        // - beware that the header delivers rules for subsequent parts of this header file but also accepts some rules from previous parts,
        // therefore its position should only be moved after careful consideration of its consequences
        //
        #include "types.h"                                               // project specific type settings and the processor header at this location
    #endif


/**************** Specify a file system for use by FTP, HTML and such functions *******************************/
//#define USE_PARAMETER_BLOCK                                            // enable a parameter block for storing and retrieving non-volatile information
    #define USE_PAR_SWAP_BLOCK                                           // we support a backup block which can be restored if desired

  //#define SPI_FILE_SYSTEM                                              // we have an external file system via SPI interface, rather than internal in FLASH
    #define FLASH_FILE_SYSTEM                                            // we have an internal file system in FLASH

#if defined FLASH_FILE_SYSTEM                                            // if either file system type is defined, ensure we have the file support
    #define ACTIVE_FILE_SYSTEM
#endif
#if defined SPI_FILE_SYSTEM
    #define ACTIVE_FILE_SYSTEM
#endif

#define SUPPORT_MIME_IDENTIFIER                                          // if the file type is to be handled (eg. when mixing HTML with JPGs etc.) this should be set - note that the file system header will be adjusted

#if defined SPI_FILE_SYSTEM
    #define uFILE_START 0                                                // SPI starts at 0 offset

    #define EEPROM_32K                                                   // 16k, 32k or 64k EEPROM

  #if defined EEPROM_16K
    #define EEPROM_PAGE_SIZE 64                                          // defined by device

    #define FILE_GRANULARITY (1024)                                      // file made up of 1k byte FLASH blocks
    #define FILE_SYSTEM_SIZE (16 * FILE_GRANULARITY)                     // 16k reserved for file system (including parameter blocks)
  #endif
  #if defined EEPROM_32K
    #define EEPROM_PAGE_SIZE 64                                          // defined by device

    #define FILE_GRANULARITY (1024)                                      // file made up of 1k byte FLASH blocks
    #define FILE_SYSTEM_SIZE (32 * FILE_GRANULARITY)                     // 32k reserved for file system (including parameter blocks)
  #endif
  #if defined EEPROM_64K
    #define EEPROM_PAGE_SIZE 128                                         // respect larger page size in SPI EEPROM

    #define FILE_GRANULARITY (2 * 1024)                                  // file made up of 2k byte FLASH blocks
    #define FILE_SYSTEM_SIZE (32 * FILE_GRANULARITY)                     // 64k reserved for file system (including parameter blocks)
  #endif
#else
 #if defined _HW_SAM7X                                                   // _HW_SAM7X
   #if defined MJB_BUILD_BC2
    #if defined SPI_SW_UPLOAD
        #define uFILE_START (0x100000)                                   // FLASH location

        #define FILE_GRANULARITY (4 * FLASH_GRANULARITY)                 // each file a multiple of 1k
        #define FILE_SYSTEM_SIZE (256 * FILE_GRANULARITY)                // 125k reserved for file system (including parameter blocks)

    #else
        #define uFILE_START (0x12a000)                                   // FLASH location

        #define FILE_GRANULARITY (4 * FLASH_GRANULARITY)                 // each file a multiple of 1k
        #define FILE_SYSTEM_SIZE (84 * FILE_GRANULARITY)                 // 84k reserved for file system (including parameter blocks)
    #endif
   #elif defined SPI_SW_UPLOAD
    #define uFILE_START (0x100000)                                       // FLASH location
    #define FILE_GRANULARITY (4 * FLASH_GRANULARITY)                     // each file a multiple of 1k
    #define FILE_SYSTEM_SIZE (256 * FILE_GRANULARITY)                    // 256k reserved for file system (including parameter blocks)

   #else
    #define uFILE_START 0x118000                                         // FLASH location at 96k start

    #define FILE_GRANULARITY (4 * FLASH_GRANULARITY)                     // each file a multiple of 1k
    #define FILE_SYSTEM_SIZE (160 * FILE_GRANULARITY)                    // 160k reserved for file system (including parameter blocks)
   #endif
 #endif
    #if defined _STR91XF                                                 // _STR91XF
        #define uFILE_START 0x80000                                      // FLASH location at 512k start

        #define FILE_GRANULARITY (FLASH_GRANULARITY)                     // each file a multiple of 64k
        #define FILE_SYSTEM_SIZE (8 * FILE_GRANULARITY + 4 * FLASH_GRANULARITY_BANK1) // 544k reserved for file system (including parameter blocks)
    #endif
    #if defined _LPC23XX || defined _LPC17XX                             // NXP
        #define uFILE_START (FLASH_START_ADDRESS)

        #define SUB_FILE_SIZE    (FILE_GRANULARITY / 8)                  // 4k sub file sizes
        #define FILE_GRANULARITY (1 * FLASH_GRANULARITY_LARGE)           // each file a multiple of 32k
        #define FILE_SYSTEM_SIZE (512 * 1024)                            // 512k devce size seen all as file system
    #endif
    #if defined _LM3SXXXX                                                // Luminary {8}
        #define uFILE_START 0x18000                                      // FLASH location at 96k start

        #define FILE_GRANULARITY (1 * FLASH_GRANULARITY)                 // each file a multiple of 1k
        #define FILE_SYSTEM_SIZE (160 * FILE_GRANULARITY)                // 160k reserved for file system (including parameter blocks)
    #endif
#endif

#if defined USE_PARAMETER_BLOCK
  #define PARAMETER_BLOCK_SIZE    FLASH_GRANULARITY                      // use the smallest size for the device

